# 06/05 - Pair Programming Limpieza 2 - Strings

**HIPOTESIS**

- ¿Es Australia es el sitio más peligroso y letal para estar relajada en la playa?

- ¿Cuál es el rango de edad que sufre la mayoría de los ataques?

- Independientemente de la edad, sufren los hombres más ataques que las mujeres?

- ¿En qué mes ocurren más ataques?

- ¿Cuál es la relación entre la especie y el tipo de ataque (si es fatal o no)?

- ¿Cómo han evolucionado los ataques a lo largo del tiempo?

De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no. **Actualizamos esta tabla ya que en el ejercicio de pair de Limpieza I ya dejamos algunas columnas limpitas:

# EJERCICIO 1

Columna de species: si exploramos esta columna en detalle nos podemos dar cuenta que tenemos muchos valores únicos y esto hace que sea muy difícil trabajar con esta columna. 

Lo que vamos a hacer es clasificar los tiburones en 5 especies diferentes, las más comunes, que incluyen el tiburón blanco (White), el tiburón tigre (Tiger ), el tiburón gris (Grey), el tiburón limón (Lemon) y el tiburón toro (Bull). 

El resto de las especies las incluiremos en un único grupo que podremos llamar "Unspecified". 

Ahora nos podemos sentir un poco abrumadas y no saber como enfrentarnos a este reto, pero don't worry, os dejamos por aquí unas 💡 pistas 💡 para que os ayuden a entender cómo hacerlo.

Los valores de las columnas son strings por lo que podremos usar regex para buscar palabras clave en cada celda y asignarlo a una de las categorías que hemos definido previamente.

Tendremos que crearnos una función que aplicaremos sobre nuestra columna species_ para que nos devuelva una nueva columna con los valores clasificados en función de los patrones de regex que hayamos definido.

In [5]:
import pandas as pd
import numpy as np
import re
df = pd.read_csv("./limpieza_1.csv", index_col=0)
df.head()

,year,type,country,sex_,age,species_,fatal_(y/n),date
0,2018,Boating,usa,F,57,White shark,N,25-Jun-2018
1,2018,Unprovoked,usa,F,11,NaN,N,18-Jun-2018
2,2018,Invalid,usa,M,48,NaN,N,09-Jun-2018
3,2018,Unprovoked,australia,M,NaN,2 m shark,N,08-Jun-2018
4,2018,Provoked,mexico,M,NaN,"Tiger shark, 3m",N,04-Jun-2018

In [6]:
df_c=df.copy()

-----

    Pruebas para reducir el bucle

In [7]:
#Pruebas , planteando poder reducir el bucle.
        
patrones_regex= (r".*[Ww](hite|HITE).*",r".*[Tt](iger|IGER).*",r".*[Gr](rey|IGER).*", r".*[Ll](emon|EMON).*", r".*[Bb](ull|ULL).*")
nombre_tiburon= ("white_shark","tiger_shark","grey_shark","lemon_shark","bull_shark")
   
def patrones_tiburon (col):
    x= re.findall(patrones_regex, col)
    if patrones_regex:
        return nombre_tiburon
    else:
        return "unspecified"

In [ ]:
df_c["species_"]= df_c["species_"].apply(patrones_tiburon)
df_c.head()

-----

    Bucle definitivo para continuar con la limpieza

In [9]:
#Patrones de busqueda, tener en cuenta que para cada palabra hay que cambiar [Ww]

patron_blanco = r".*[Ww](hite|HITE).*"
patron_tigre= r".*[Tt](iger|IGER).*"
patron_gris= r".*[Gr](rey|IGER).*"
patron_limon= r".*[Ll](emon|EMON).*"
patron_toro= r".*[Bb](ull|ULL).*"

In [10]:
def tiburon(col):
    try:
        if re.findall(patron_blanco, col):
            return "white_shark"
        elif re.findall(patron_tigre, col):
            return "tiger_shark"
        elif re.findall(patron_gris, col):
            return "grey_shark"
        elif re.findall(patron_gris, col):
            return "lemon_shark"
        elif re.findall(patron_limon, col):
            return "bull_shark"
        else:
            return "unspecified"
    except:
        return "unspecified"

In [11]:
#Aplicamos función a la columna con el método .apply
df_c["species_"]= df_c["species_"].apply(tiburon)
df_c.head()

   year        type    country sex_  age     species_ fatal_(y/n)         date
0  2018     Boating        usa    F   57  white_shark           N  25-Jun-2018
1  2018  Unprovoked        usa    F   11  unspecified           N  18-Jun-2018
2  2018     Invalid        usa    M   48  unspecified           N  09-Jun-2018
3  2018  Unprovoked  australia    M  NaN  unspecified           N  08-Jun-2018
4  2018    Provoked     mexico    M  NaN  tiger_shark           N  04-Jun-2018

In [12]:
#Comprobamos que los valores únicos son los que nosotros queríamos establecer en cada caso.
df_c["species_"].unique()

array(['white_shark', 'unspecified', 'tiger_shark', 'bull_shark',
       'grey_shark'], dtype=object)

# EJERCICIO 2

Columna de age: es una columna de tipo string pero debería ser de tipo integer. Además, en esta columna nos vamos a encontrar con algunos errores tipográficos, estos incluyen:
- Edaden formato string

- Edades separadas por &, or, to, >

- Edades con ?

Vamos con algunas 💡 pistas 💡 para que os ayuden a entender cómo hacerlo:

- Primero tendremos que eliminar todos esos símbolos especiales que nos aparecen. De nuevo, podremos usar regex para extraer unicamente los números que es lo que nos interesa. Usar este regex en una función para sacar solo los números.

- Puede que os salga un error similar a este:
<br><font color=green>TypeError: expected string or bytes-like object</font>

- Para solucionar este problema, antes de nada tendréis que ejecutar este código para que no os de error:
c

- Una vez que hayáis extraido los números, os daréis cuenta que hay celdas que tienen más de una edad. Tendréis que decidir que hacer en esos casos. Os dejamos por aquí una posible opción usando un método de Pandas que os puede resultar super útil. El método explode, aqui.

- Por último cambiad el tipo de la columna de string a integer.

In [13]:
#Hacemos una copia para el ejercicio 2
df_s=df_c.copy()

In [14]:
df_s.head(2)

   year        type country sex_ age     species_ fatal_(y/n)         date
0  2018     Boating     usa    F  57  white_shark           N  25-Jun-2018
1  2018  Unprovoked     usa    F  11  unspecified           N  18-Jun-2018

In [ ]:
df_s.dtypes

year            int64
type           object
country        object
sex_           object
age            object
species_       object
fatal_(y/n)    object
date           object
dtype: object

In [15]:
#Valoramos toda la información que encontramos dentro de la columna age, ¿Que debemos hacer con estos valores?
df_s["age"].unique()

array(['57', '11', '48', nan, '18', '52', '15', '12', '32', '10', '21',
       '34', '30', '60', '33', '29', '54', '41', '37', '56', '19', '25',
       '69', '38', '55', '35', '46', '45', '14', '40s', '28', '20', '24',
       '26', '49', '22', '7', '31', '17', '40', '13', '42', '3', '8',
       '50', '16', '82', '73', '20s', '68', '51', '39', '58', 'Teen',
       '47', '61', '65', '36', '66', '43', '60s', '9', '72', '59', '6',
       '27', '64', '23', '71', '44', '62', '63', '70', '18 months', '53',
       '30s', '50s', 'teen', '77', '74', '28 & 26', '5', '86', '18 or 20',
       '12 or 13', '46 & 34', '28, 23 & 30', 'Teens', '36 & 26',
       '8 or 10', '84', '\xa0 ', ' ', '30 or 36', '6½', '21 & ?', '75',
       '33 or 37', 'mid-30s', '23 & 20', ' 30', '7      &    31', ' 28',
       '20?', "60's", '32 & 30', '16 to 18', '87', '67', 'Elderly',
       'mid-20s', 'Ca. 33', '74 ', '45 ', '21 or 26', '20 ', '>50',
       '18 to 22', 'adult', '9 & 12', '? & 19', '9 months', '25 to 35',
       '23 & 26', '1', '(adult)', '33 & 37', '25 or 28',
       '37, 67, 35, 27,  ? & 27', '21, 34,24 & 35', '30 & 32', '50 & 30',
       '17 & 35', 'X', '"middle-age"', '13 or 18', '34 & 19', '33 & 26',
       '2 to 3 months', 'MAKE LINE GREEN', ' 43', '81', '"young"',
       '7 or 8', '78', '17 & 16', 'F', 'Both 11', '9 or 10', 'young',
       '36 & 23', '  ', 'A.M.', '?    &   14', '10 or 12', '31 or 33',
       '2½', '13 or 14'], dtype=object)

In [16]:
df_s['age'] = df_s['age'].astype(str)
df_s.dtypes

year            int64
type           object
country        object
sex_           object
age            object
species_       object
fatal_(y/n)    object
date           object
dtype: object

In [17]:
df_s.explode("age")

,year,type,country,sex_,age,species_,fatal_(y/n),date
0,2018,Boating,usa,F,57,white_shark,N,25-Jun-2018
1,2018,Unprovoked,usa,F,11,unspecified,N,18-Jun-2018
2,2018,Invalid,usa,M,48,unspecified,N,09-Jun-2018
3,2018,Unprovoked,australia,M,nan,unspecified,N,08-Jun-2018
4,2018,Provoked,mexico,M,nan,tiger_shark,N,04-Jun-2018
...,...,...,...,...,...,...,...,...
6278,0,Unprovoked,australia,M,nan,unspecified,Y,Before 1906
6279,0,Unprovoked,australia,M,nan,unspecified,Y,Before 1903
6281,0,Unprovoked,usa,M,nan,unspecified,Y,1900-1905
6282,0,Unprovoked,panama,M,nan,unspecified,Y,1883-1889
6283,0,Unprovoked,ceylon (sri lanka),M,15,unspecified,Y,1845-1853

    Con el patrón de regex, queremos quedarnos con lo siguiente: valor numérico de 1 o 2 números máx, resto será desechado .

In [18]:
#Función para "age" con regex
patron = "[0-9]{1,2}"
def limpio (col):
    x= re.findall(patron, col)
    if len(x)>0:
        return x[0]
    else:
        return "0"

In [19]:
#Aplicamos el método a la columna "age"
df_s["age"]= df_s["age"].apply(limpio)

In [20]:
#Comprobamos que ha sido correcta la ejecucción.
df_s["age"].unique()

array(['57', '11', '48', '0', '18', '52', '15', '12', '32', '10', '21',
       '34', '30', '60', '33', '29', '54', '41', '37', '56', '19', '25',
       '69', '38', '55', '35', '46', '45', '14', '40', '28', '20', '24',
       '26', '49', '22', '7', '31', '17', '13', '42', '3', '8', '50',
       '16', '82', '73', '68', '51', '39', '58', '47', '61', '65', '36',
       '66', '43', '9', '72', '59', '6', '27', '64', '23', '71', '44',
       '62', '63', '70', '53', '77', '74', '5', '86', '84', '75', '87',
       '67', '1', '2', '81', '78'], dtype=object)

In [21]:
df_s["age"].dtype

dtype('O')

In [22]:
#Cambiamos el tipo a "age" de "object" a "inst64"
df_s["age"] = df_s["age"].astype('int64')

In [23]:
#Es la media de edad
media= df_s[df_s["age"]>0]["age"].mean()
media= round(media)
media

27

In [24]:
df_s["age"].replace({0: media}, inplace= True)

In [25]:
df_s.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6237 entries, 0 to 6283
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   year         6237 non-null   int64
 1   type         6233 non-null   object
 2   country      6188 non-null   object
 3   sex_         5675 non-null   object
 4   age          6237 non-null   int64
 5   species_     6237 non-null   object
 6   fatal_(y/n)  5705 non-null   object
 7   date         6237 non-null   object
dtypes: int64(2), object(6)
memory usage: 438.5+ KB

    Guardamos para próxima limpieza

In [26]:
df_s.to_csv("limpio2.csv")#este nos vale para el ejercicio limpieza III